&НаКлиенте
Процедура КатегорияТоваровПриИзменении(Элемент)
	КатегорияТоваровПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КатегорияТоваровПриИзмененииНаСервере()
	Объект.Статус = Справочники.СтатусЗаказа.НайтиПоНаименованию("Не утвержден");
	Объект.Поставщик = Справочники.Поставщики.НайтиПоРеквизиту("КатегорияТоваров", Объект.КатегорияТоваров);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьТЧПоЗаявкам(Команда)
	ЗаполнитьТЧПоЗаявкамНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧПоЗаявкамНаСервере()
	Объект.Товары.Очистить();
	ТекКатегория = Объект.КатегорияТоваров;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутренниеЗаявки.Товар КАК Номенклатура,
		|	СУММА(ВнутренниеЗаявки.Количество) КАК Количество,
		|	ВнутренниеЗаявки.Цена КАК Цена
		|ИЗ
		|	Документ.ВнутренниеЗаявки КАК ВнутренниеЗаявки
		|ГДЕ
		|	ВнутренниеЗаявки.КатегорияТоваров = &ТекКатегория
		|СГРУППИРОВАТЬ ПО
		|	ВнутренниеЗаявки.Товар,
		|	ВнутренниеЗаявки.Цена";
		
	Запрос.УстановитьПараметр("ТекКатегория", ТекКатегория);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Объект.Товары.Добавить();
		Строка.Номенклатура = Выборка.Номенклатура;
		Строка.Количество = Выборка.Количество;
		Строка.Цена = Выборка.Цена;
		Строка.Сумма = Строка.Цена * Строка.Количество;
	КонецЦикла;
	
	Объект.СуммаЗаказа = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры














