&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	Стр.Сумма = Стр.Цена * Стр.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧПоЗаявкам(Команда)
	ЗаполнитьТЧПоЗаявкамНаСервере();
КонецПроцедуры

Процедура ЗаполнитьТЧПоЗаявкамНаСервере()
	Объект.Товары.Очистить();
	тз = Новый ТаблицаЗначений;
    тз.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ВнутренниеЗаявки"));
    
    Для Каждого Заявка из Заявки Цикл
        ЗаполнитьЗначенияСвойств(тз.Добавить(), Заявка.Значение)
    КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнутренниеЗаявкиТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ВнутренниеЗаявкиТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ВнутренниеЗаявки.Товары КАК ВнутренниеЗаявкиТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
		|		ПО ВнутренниеЗаявкиТовары.Ссылка = ТЗ.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВнутренниеЗаявкиТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Строка = Объект.Товары.Добавить();
		Строка.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		Строка.Количество = ВыборкаДетальныеЗаписи.Количество;
	КонецЦикла;
	
КонецПроцедуры



