&НаКлиенте
Процедура КатегорияТоваровПриИзменении(Элемент)
	КатегорияТоваровПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КатегорияТоваровПриИзмененииНаСервере()
	Объект.Поставщик = Справочники.Поставщики.НайтиПоРеквизиту("КатегорияТоваров", Объект.КатегорияТоваров);
	Объект.Статус = Перечисления.СтатусЗаказа.НеСогласован;
КонецПроцедуры



&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	ЗаполнитьТЧНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧНаСервере()
	Объект.Товары.Очистить();
	ТекКатегория = Объект.КатегорияТоваров;
	СвободЗаявка = Перечисления.СтатусЗаявки.НеВЗаказе;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутренниеЗаявки.Товар КАК Номенклатура,
		|	ВнутренниеЗаявки.Цена КАК Цена,
		|	СУММА(ВнутренниеЗаявки.НадоПриобрести) КАК НадоПриобрести,
		|	ВнутренниеЗаявки.Номер КАК Номер
		|ИЗ
		|	Документ.ВнутренниеЗаявки КАК ВнутренниеЗаявки
		|ГДЕ
		|	ВнутренниеЗаявки.КатегорияТоваров = &ТекКатегория
		|	И ВнутренниеЗаявки.ПометкаУдаления = ЛОЖЬ
		|	И ВнутренниеЗаявки.Статус = &СвободЗаявка
		|СГРУППИРОВАТЬ ПО
		|	ВнутренниеЗаявки.Товар,
		|	ВнутренниеЗаявки.Цена,
		|	ВнутренниеЗаявки.Номер";
		
	Запрос.УстановитьПараметр("ТекКатегория", ТекКатегория);
	Запрос.УстановитьПараметр("СвободЗаявка", СвободЗаявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Объект.Товары.Добавить();
		Строка.Номенклатура = Выборка.Номенклатура;
		Строка.Количество = Выборка.НадоПриобрести;
		Строка.Цена = Выборка.Цена;
		Строка.Сумма = Строка.Цена * Строка.Количество;
		Строка.НомерЗаявки = Выборка.Номер;
	КонецЦикла;
	
	Объект.СуммаЗаказа = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;
	Объект.СуммаЗаказа = Объект.Товары.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Стр = Элементы.Товары.ТекущиеДанные;
	Стр.Сумма = Стр.Количество * Стр.Цена;
	Объект.СуммаЗаказа = Объект.Товары.Итог("Сумма");
КонецПроцедуры



&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	ТоварыПередУдалениемНаСервере(Элементы.Товары.ТекущиеДанные.Номенклатура, 
			Элементы.Товары.ТекущиеДанные.Количество, 
			Элементы.Товары.ТекущиеДанные.Цена,
			Элементы.Товары.ТекущиеДанные.НомерЗаявки);
КонецПроцедуры

&НаСервере
Процедура ТоварыПередУдалениемНаСервере(Товар, колво, цена, номер)
	Если Объект.Статус = Перечисления.СтатусЗаказа.НеСогласован Тогда
		Если ЗначениеЗаполнено(номер) Тогда
			ТекТовар = Документы.ВнутренниеЗаявки.НайтиПоНомеру(номер).ПолучитьОбъект();
			ТекТовар.Статус = Перечисления.СтатусЗаявки.НеВЗаказе;
			ТекТовар.НадоПриобрести = колво;
			ТекТовар.Записать(РежимЗаписиДокумента.Проведение);
		Иначе 
			НовЗаявка = Документы.ВнутренниеЗаявки.СоздатьДокумент();
			НовЗаявка.Дата = ТекущаяДата();
			НовЗаявка.Товар = Товар;
			НовЗаявка.КатегорияТоваров = Объект.КатегорияТоваров;
			НовЗаявка.Статус = Перечисления.СтатусЗаявки.НеВЗаказе;
			НовЗаявка.НадоПриобрести = колво;
			НовЗаявка.Цена = цена;
			НовЗаявка.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры






