&НаКлиенте
Процедура ТоварПриИзменении(Элемент)
	ТоварПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТоварПриИзмененииНаСервере()
	Объект.Цена = Справочники.Номенклатура.НайтиПоНаименованию(Объект.Товар.Наименование).Цена;
	ТекРодитель = Объект.Товар.Родитель;
	Объект.КатегорияТоваров = Справочники.КатегорииТоваров.НайтиПоНаименованию(ТекРодитель);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЗаявкаЕсть = ЕстьЗаявка();
	
	Если ЗаявкаЕсть Тогда	
		НадоДобавить = Вопрос("Заявка по этому товару уже существует.
		|Добавить введенное количество к уже существующему?", РежимДиалогаВопрос.ДаНет);
		Если НадоДобавить = КодВозвратаДиалога.Да Тогда
			ДобавитьКолво();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКолво()
	ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", Объект.Товар).ПолучитьОбъект();
	ТекЗаявка.Количество = ТекЗаявка.Количество + Объект.Количество;
	ТекЗаявка.Записать();
КонецПроцедуры


Функция ЕстьЗаявка()
	Если Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", Объект.Товар).Пустая() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции





