&НаКлиенте
Процедура ТоварПриИзменении(Элемент)
	ТоварПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	Если Объект.Товар.Пустая() И Объект.НадоПриобрести.Пустая() Тогда
		Оповещение = Новый ОписаниеОповещения();	
	    ПоказатьПредупреждение(
    	    Оповещение,
        	"Заполните обязательные поля (Товар, Надо Приобрести)");
	Иначе
		СоздатьЗаказНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаказНаСервере()
	НовДок = Документы.Заказы.СоздатьДокумент();
	НовДок.Дата = ТекущаяДата();
	Категория = Справочники.КатегорииТоваров.НайтиПоНаименованию(Объект.Товар.Родитель.Наименование);
	НовДок.КатегорияТоваров = Категория;
	НовДок.Поставщик = Справочники.Поставщики.НайтиПоРеквизиту("КатегорияТоваров", Категория);
	НовДок.Статус = Перечисления.СтатусЗаказа.НеСогласован;
	стр = НовДок.Товары.Добавить();
	стр.Номенклатура = Объект.Товар;
	стр.Количество = Объект.НадоПриобрести;
	стр.Цена = Объект.Товар.Цена;
	стр.Сумма = стр.Цена * стр.Количество;
	стр.НомерЗаявки = Объект.Номер;
	НовДок.СуммаЗаказа = стр.Сумма;
	НовДок.Записать();
КонецПроцедуры


&НаСервере
Процедура ТоварПриИзмененииНаСервере()
	Родитель = Объект.Товар.Родитель.Наименование;
	Объект.КатегорияТоваров = Справочники.КатегорииТоваров.НайтиПоНаименованию(Родитель);
	Объект.Цена = Объект.Товар.Цена;
	Объект.Статус = Перечисления.СтатусЗаявки.НеВЗаказе;
КонецПроцедуры



&НаКлиенте
Процедура ТекущееКоличествоПриИзменении(Элемент)
	Если ТекКоличествоДостаточно() Тогда
		Если ТекКоличествоМного() Тогда
			Ответ = Вопрос("Текущее количество товаров больше максимального. 
							|Вы уверены, что хотите создать заявку?", РежимДиалогаВопрос.ДаНетОтмена, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				ЭтаФорма.Закрыть();	
			КонецЕсли;		
		Иначе
			Ответ = Вопрос("Текущее количество товаров больше минимального. 
							|Вы уверены, что хотите создать заявку?", РежимДиалогаВопрос.ДаНетОтмена, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				ЭтаФорма.Закрыть();	
			Иначе
				ТекущееКоличествоПриИзмененииНаСервере();
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекущееКоличествоПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ТекущееКоличествоПриИзмененииНаСервере()
	Если Объект.Товар.МаксимальноеКоличество > Объект.ТекущееКоличество Тогда
		Объект.НадоПриобрести = Объект.Товар.МаксимальноеКоличество - Объект.ТекущееКоличество;
	КонецЕсли;
КонецПроцедуры


Функция ТекКоличествоДостаточно()
	Возврат Объект.ТекущееКоличество >= Объект.Товар.МинимальноеКоличество;
КонецФункции

Функция ТекКоличествоМного()
	Возврат Объект.ТекущееКоличество >= Объект.Товар.МаксимальноеКоличество;
КонецФункции