&НаКлиенте
Процедура ТоварПриИзменении(Элемент)
	ТоварПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТоварПриИзмененииНаСервере()
	Родитель = Объект.Товар.Родитель.Наименование;
	Объект.КатегорияТоваров = Справочники.КатегорииТоваров.НайтиПоНаименованию(Родитель);
	Объект.Цена = Объект.Товар.Цена;
	Объект.Статус = Перечисления.СтатусЗаявки.НеВЗаказе;
КонецПроцедуры



&НаКлиенте
Процедура ТекущееКоличествоПриИзменении(Элемент)
	Если ТекКоличествоДостаточно() Тогда
		Если ТекКоличествоМного() Тогда
			Ответ = Вопрос("Текущее количество товаров больше максимального. 
							|Вы уверены, что хотите создать заявку?", РежимДиалогаВопрос.ДаНетОтмена, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				ЭтаФорма.Закрыть();	
			КонецЕсли;		
		Иначе
			Ответ = Вопрос("Текущее количество товаров больше минимального. 
							|Вы уверены, что хотите создать заявку?", РежимДиалогаВопрос.ДаНетОтмена, 0);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				ЭтаФорма.Закрыть();	
			Иначе
				ТекущееКоличествоПриИзмененииНаСервере();
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекущееКоличествоПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ТекущееКоличествоПриИзмененииНаСервере()
	Если Объект.Товар.МаксимальноеКоличество > Объект.ТекущееКоличество Тогда
		Объект.НадоПриобрести = Объект.Товар.МаксимальноеКоличество - Объект.ТекущееКоличество;
	КонецЕсли;
КонецПроцедуры


Функция ТекКоличествоДостаточно()
	Возврат Объект.ТекущееКоличество >= Объект.Товар.МинимальноеКоличество;
КонецФункции

Функция ТекКоличествоМного()
	Возврат Объект.ТекущееКоличество >= Объект.Товар.МаксимальноеКоличество;
КонецФункции