Процедура ПередУдалением(Отказ)
	Если ЭтотОбъект.ЭтоГруппа Тогда
		КатегорияТоваров = Справочники.КатегорииТоваров.НайтиПоНаименованию(ЭтотОбъект.Наименование).ПолучитьОбъект();
		КатегорияТоваров.Удалить();
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Если Справочники.КатегорииТоваров.НайтиПоНаименованию(ЭтотОбъект.Наименование).Пустая() Тогда
			КатегорияТоваров = Справочники.КатегорииТоваров.СоздатьЭлемент();
			КатегорияТоваров.Наименование = ЭтотОбъект.Наименование;
			КатегорияТоваров.Записать();
		Иначе
			Если ЭтотОбъект.ПометкаУдаления Тогда
				КатегорияТоваров = Справочники.КатегорииТоваров.НайтиПоНаименованию(ЭтотОбъект.Наименование).ПолучитьОбъект();
				КатегорияТоваров.УстановитьПометкуУдаления(Истина);
				КатегорияТоваров.Записать();
			ИначеЕсли Не ЭтотОбъект.ПометкаУдаления Тогда
				КатегорияТоваров = Справочники.КатегорииТоваров.НайтиПоНаименованию(ЭтотОбъект.Наименование).ПолучитьОбъект();
				КатегорияТоваров.УстановитьПометкуУдаления(Ложь);
				КатегорияТоваров.Записать();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры