Процедура ПередУдалением(Отказ)
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Элемент = Справочники.КатегорииТоваров.НайтиПоНаименованию(ЭтотОбъект.Наименование).ПолучитьОбъект();
		Элемент.Удалить();
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтотОбъект.ЭтоГруппа Тогда
		Если Справочники.КатегорииТоваров.НайтиПоНаименованию(ЭтотОбъект.Наименование).Пустая() Тогда
			Элемент = Справочники.КатегорииТоваров.СоздатьЭлемент();
			Элемент.Наименование = ЭтотОбъект.Наименование;
			Элемент.Записать();
		Иначе
			Если ЭтотОбъект.ПометкаУдаления Тогда
				Элемент = Справочники.КатегорииТоваров.НайтиПоНаименованию(ЭтотОбъект.Наименование).ПолучитьОбъект();
				Элемент.УстановитьПометкуУдаления(Истина);
				Элемент.Записать();
			ИначеЕсли Не ЭтотОбъект.ПометкаУдаления Тогда
				Элемент = Справочники.КатегорииТоваров.НайтиПоНаименованию(ЭтотОбъект.Наименование).ПолучитьОбъект();
				Элемент.УстановитьПометкуУдаления(Ложь);;
				Элемент.Записать();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры