Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЭтотОбъект.СуммаЗаказа = ЭтотОбъект.Товары.Итог("Сумма");
	
	ТаблТовары = ЭтотОбъект.Товары.Выгрузить();
	
	Если ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.НеСогласован Тогда
		Для каждого стр из ТаблТовары Цикл
			Если ЗначениеЗаполнено(Стр.НомерДокумента) Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоНомеру(Стр.НомерДокумента).ПолучитьОбъект();
				ТекЗаявка.Статус = Перечисления.СтатусЗаявки.ВНеСогласованомЗаказе;
				ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Согласован или ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Оплачен Тогда
		Для каждого стр из ТаблТовары Цикл
			Если ЗначениеЗаполнено(Стр.НомерДокумента) Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоНомеру(Стр.НомерДокумента).ПолучитьОбъект();
				ТекЗаявка.Статус = Перечисления.СтатусЗаявки.ВСогласованномЗаказе;
				ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	
	ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Получен Тогда
		Для каждого стр из ТаблТовары Цикл
			Если ЗначениеЗаполнено(Стр.НомерДокумента) Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоНомеру(Стр.НомерДокумента).ПолучитьОбъект();
				ТекЗаявка.Статус = Перечисления.СтатусЗаявки.Получен;
				ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Получен Тогда
		Сообщить(ЭтотОбъект.Номер);
		Сообщить(Документы.Поступления.НайтиПоНомеру("000000001").НомерЗаказа);
		Сообщить(Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("КатегорияТоваров", ЭтотОбъект.КатегорияТоваров))
//		Если Документы.Поступления.НайтиПоРеквизиту("НомерЗаказа", ЭтотОбъект.Номер).Пустая() Тогда
//			ДокументПоступление = Документы.Поступления.СоздатьДокумент();
//			ДокументПоступление.Дата = ТекущаяДата();
//			ДокументПоступление.НомерЗаказа = ЭтотОбъект.Номер;
//			ДокументПоступление.СуммаЗаказа = ЭтотОбъект.СуммаЗаказа;
//			Таб = ЭтотОбъект.Товары.Выгрузить();
//			Для каждого стр из Таб Цикл
//				НовСтр = ДокументПоступление.Товары.Добавить();
//				НовСтр.Номенклатура = стр.Номенклатура;
//				НовСтр.Количество = стр.Количество;
//				НовСтр.Сумма = стр.Сумма;
//				НовСтр.Цена = стр.Цена;
//			КонецЦикла;
//			ДокументПоступление.Записать();
//		КонецЕсли;
//		Движения.ОстаткиТоваров.Записывать = Истина;
//		Для Каждого ТекСтрокаТовары Из Товары Цикл
//			Движение = Движения.ОстаткиТоваров.Добавить();
//			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//			Движение.Период = Дата;
//			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
//			Движение.Количество = ТекСтрокаТовары.Количество;
//		КонецЦикла;
	ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.НеСогласован Тогда
//		НаписатьПисьмо();
	КонецЕсли;
КонецПроцедуры



Процедура НаписатьПисьмо()
	ПрофильПодключения = Новый ИнтернетПочтовыйПрофиль;
	ПрофильПодключения.АдресСервераSMTP ="smtp адрес сервера";
 
	ПрофильПодключения.ИспользоватьSSLSMTP=Истина;
 
	ПрофильПодключения.ПортSMTP = 465;
 
	ПрофильПодключения.ПользовательSMTP = "АдресКомпании";
	ПрофильПодключения.ПарольSMTP = "Пароль";
 

	Почта = Новый ИнтернетПочта;
 

	Попытка
		Почта.Подключиться(ПрофильПодключения);
	Исключение
		Сообщить("Не удалось подключиться к серверу ""smtp адрес сервера""");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
 
	Тело="Добрый день!
	|Вас приветствует компания ""Название Компании""
	|Хотим сделать заказ!    
	|
	|";

	Письмо = Новый ИнтернетПочтовоеСообщение;
 
	Письмо.Тексты.Добавить(Тело);
	
	Выборка = Товары.Выгрузить();
	
	Для каждого стр из Выборка Цикл
		Письмо.Тексты.Добавить(стр.Номенклатура.Наименование + " в количестве " + стр.ТекущееКоличество + "шт.");
	КонецЦикла;
	
	
	Письмо.Тема = "Хотим сделать у вас заказ";
	Письмо.Отправитель = "Адрес вашей Компании";
	Письмо.ИмяОтправителя = "Название вашей Компании";
	Письмо.Получатели.Добавить(ЭтотОбъект.Поставщик.Email);


    Попытка
		Почта.Послать(Письмо);
    Исключение
        Сообщить("Не удалось отправить письмо ");
        Сообщить(ОписаниеОшибки());
	КонецПопытки;	

	Почта.Отключиться();

КонецПроцедуры


Процедура ПередУдалением(Отказ)
	Если ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.НеСогласован Тогда
		Для каждого СтрТовары из Товары Цикл
			Если ЗначениеЗаполнено(СтрТовары.НомерДокумента) Тогда
				ТекТовар = Документы.ВнутренниеЗаявки.НайтиПоНомеру(СтрТовары.НомерДокумента).ПолучитьОбъект();
				ТекТовар.Статус = Перечисления.СтатусЗаявки.НеВЗаказе;
				ТекТовар.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры







