Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЭтотОбъект.СуммаЗаказа = ЭтотОбъект.Товары.Итог("Сумма");
	
	ТаблТовары = ЭтотОбъект.Товары.Выгрузить();
	
	Если ЭтотОбъект.Статус = Справочники.СтатусЗаказа.НайтиПоНаименованию("Не утвержден") Тогда
		Для каждого стр из ТаблТовары Цикл
			Если Не Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", стр.Номенклатура).Пустая() Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", Стр.Номенклатура).ПолучитьОбъект();
				ТекЗаявка.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.Статус = Справочники.СтатусЗаказа.НайтиПоНаименованию("Утвержден") Тогда
		Для каждого стр из ТаблТовары Цикл
			Если Не Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", стр.Номенклатура).Пустая() Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", Стр.Номенклатура).ПолучитьОбъект();
				ТекЗаявка.Удалить();
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.Статус = Справочники.СтатусЗаказа.НайтиПоНаименованию("Получен") Тогда
		Для каждого стр из ТаблТовары Цикл
			ТекТовар = стр.Номенклатура.ПолучитьОбъект(); 
			ТекТовар.ТекущееКоличество = ТекТовар.ТекущееКоличество + стр.Количество;
			ТекТовар.Записать();
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ЭтотОбъект.Статус = Справочники.СтатусЗаказа.НайтиПоНаименованию("Закрыт") Тогда
		Движения.ОстаткиТоваров.Записывать = Истина;
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Количество = ТекСтрокаТовары.Количество;
		КонецЦикла;

	ИначеЕсли ЭтотОбъект.Статус = Справочники.СтатусЗаказа.НайтиПоНаименованию("Утвержден") Тогда
//		НаписатьПисьмо();
	КонецЕсли;
	
КонецПроцедуры



Процедура НаписатьПисьмо()
	ПрофильПодключения = Новый ИнтернетПочтовыйПрофиль;
	ПрофильПодключения.АдресСервераSMTP ="smtp адрес сервера";
 
	ПрофильПодключения.ИспользоватьSSLSMTP=Истина;
 
	ПрофильПодключения.ПортSMTP = 465;
 
	ПрофильПодключения.ПользовательSMTP = "АдресКомпании";
	ПрофильПодключения.ПарольSMTP = "Пароль";
 

	Почта = Новый ИнтернетПочта;
 

	Попытка
		Почта.Подключиться(ПрофильПодключения);
	Исключение
		Сообщить("Не удалось подключиться к серверу ""smtp адрес сервера""");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
 
	Тело="Добрый день!
	|Вас приветствует компания ""Название Компании""
	|Хотим сделать заказ!    
	|
	|";

	Письмо = Новый ИнтернетПочтовоеСообщение;
 
	Письмо.Тексты.Добавить(Тело);
	
	Выборка = Товары.Выгрузить();
	
	Для каждого стр из Выборка Цикл
		Письмо.Тексты.Добавить(стр.Номенклатура.Наименование + " в количестве " + стр.Количество + "шт.");
	КонецЦикла;
	
	
	Письмо.Тема = "Хотим сделать у вас заказ";
	Письмо.Отправитель = "Адрес вашей Компании";
	Письмо.ИмяОтправителя = "Название вашей Компании";
	Письмо.Получатели.Добавить(ЭтотОбъект.Поставщик.Email);


    Попытка
		Почта.Послать(Письмо);
    Исключение
        Сообщить("Не удалось отправить письмо ");
        Сообщить(ОписаниеОшибки());
	КонецПопытки;	

	Почта.Отключиться();

КонецПроцедуры



Процедура ПередУдалением(Отказ)
	Для каждого СтрТовары из Товары Цикл
		Если Не Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", СтрТовары.Номенклатура).Пустая() Тогда
			ТекТовар = Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", СтрТовары.Номенклатура).ПолучитьОбъект();
			ТекТовар.УстановитьПометкуУдаления(Ложь);
			ТекТовар.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры




