Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЭтотОбъект.СуммаЗаказа = ЭтотОбъект.Товары.Итог("Сумма");
	
	ТаблТовары = ЭтотОбъект.Товары.Выгрузить();
	
	Если ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.НеСогласован Тогда
		Для каждого стр из ТаблТовары Цикл
			Если ЗначениеЗаполнено(Стр.НомерЗаявки) Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоНомеру(Стр.НомерЗаявки).ПолучитьОбъект();
				ТекЗаявка.Статус = Перечисления.СтатусЗаявки.ВНеСогласованомЗаказе;
				ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Согласован или ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Оплачен Тогда
		Для каждого стр из ТаблТовары Цикл
			Если ЗначениеЗаполнено(Стр.НомерЗаявки) Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоНомеру(Стр.НомерЗаявки).ПолучитьОбъект();
				ТекЗаявка.Статус = Перечисления.СтатусЗаявки.ВСогласованномЗаказе;
				ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	
	ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Получен Тогда
		Для каждого стр из ТаблТовары Цикл
			Если ЗначениеЗаполнено(Стр.НомерЗаявки) Тогда
				ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоНомеру(Стр.НомерЗаявки).ПолучитьОбъект();
				ТекЗаявка.Статус = Перечисления.СтатусЗаявки.Получен;
				ТекЗаявка.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.Получен Тогда
		Если Документы.Поступления.НайтиПоРеквизиту("НомерЗаказа", ЭтотОбъект.Номер).Пустая() Тогда
			ДокументПоступление = Документы.Поступления.СоздатьДокумент();
			ДокументПоступление.Дата = ТекущаяДата();
			ДокументПоступление.НомерЗаказа = ЭтотОбъект.Номер;
			ДокументПоступление.СуммаЗаказа = ЭтотОбъект.СуммаЗаказа;
			ДокументПоступление.Поставщик = ЭтотОбъект.Поставщик;
			ДокументПоступление.КатегорияТоваров = ЭтотОбъект.КатегорияТоваров;
			Таб = ЭтотОбъект.Товары.Выгрузить();
			Для каждого стр из Таб Цикл
				НовСтр = ДокументПоступление.Товары.Добавить();
				НовСтр.Номенклатура = стр.Номенклатура;
				НовСтр.Количество = стр.Количество;
				НовСтр.Сумма = стр.Сумма;
				НовСтр.Цена = стр.Цена;
			КонецЦикла;
			ДокументПоступление.Записать();
		КонецЕсли;
	ИначеЕсли ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.НеСогласован Тогда
		НаписатьПисьмо();
	КонецЕсли;
КонецПроцедуры



Процедура НаписатьПисьмо()
	ПрофильПодключения = Новый ИнтернетПочтовыйПрофиль;
	ПрофильПодключения.АдресСервераSMTP = Константы.АдресСервераSMTP.Получить();
	Сообщить(Константы.АдресСервераSMTP.Получить()); 
	ПрофильПодключения.ИспользоватьSSLSMTP=Истина;
	ПрофильПодключения.ПортSMTP = Константы.ПортSMTP.Получить();
	ПрофильПодключения.ПользовательSMTP = Константы.Email.Получить();
	ПрофильПодключения.ПарольSMTP = Константы.Пароль.Получить();
	ПрофильПодключения.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;

	Почта = Новый ИнтернетПочта; 
	Попытка
		Почта.Подключиться(ПрофильПодключения);
	Исключение
		Сообщить("Не удалось подключиться к серверу ""smtp адрес сервера""");
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
 
	Письмо = Новый ИнтернетПочтовоеСообщение;
 	Письмо.Тексты.Добавить("Добрый день!
	|Вас приветствует компания НазваниеКомпании 
	|Хотим сделать заказ");
	
	Выборка = Товары.Выгрузить();
	
	Для каждого стр из Выборка Цикл
		Письмо.Тексты.Добавить(стр.Номенклатура.Наименование + " в количестве " + стр.Количество + "шт.");
	КонецЦикла;
	
	Письмо.Тема = "Хотим сделать у вас Заказ " + ЭтотОбъект.Номер;
	Письмо.Отправитель = Константы.Email.Получить();
	Сообщить(Константы.Email.Получить());
	Письмо.ИмяОтправителя = "Название вашей Компании";
	Письмо.Получатели.Добавить(ЭтотОбъект.Поставщик.Email);

    Попытка
		Почта.Послать(Письмо);
    Исключение
        Сообщить("Не удалось отправить письмо ");
        Сообщить(ОписаниеОшибки());
	КонецПопытки;	

	Почта.Отключиться();
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	Если ЭтотОбъект.Статус = Перечисления.СтатусЗаказа.НеСогласован Тогда
		Для каждого СтрТовары из Товары Цикл
			Если ЗначениеЗаполнено(СтрТовары.НомерЗаявки) Тогда
				ТекТовар = Документы.ВнутренниеЗаявки.НайтиПоНомеру(СтрТовары.НомерЗаявки).ПолучитьОбъект();
				ТекТовар.Статус = Перечисления.СтатусЗаявки.НеВЗаказе;
				ТекТовар.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры







