&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ТекущееКоличество < Объект.МинимальноеКоличество Тогда
		СоздатьЗаявку();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура СоздатьЗаявку()
	Если Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", Объект.Ссылка).Пустая() Тогда
		НовЗаявка = Документы.ВнутренниеЗаявки.СоздатьДокумент();
		НовЗаявка.Дата = ТекущаяДата();
		НовЗаявка.Товар = Объект.Ссылка;
		НовЗаявка.КатегорияТоваров = Справочники.КатегорииТоваров.НайтиПоНаименованию(Объект.Родитель.Наименование);
		НовЗаявка.Цена = Объект.Цена;
		НовЗаявка.Количество = Объект.МаксимальноеКоличество - Объект.ТекущееКоличество;
		НовЗаявка.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ТекЗаявка = Документы.ВнутренниеЗаявки.НайтиПоРеквизиту("Товар", Объект.Ссылка).ПолучитьОбъект();
		ТекЗаявка.Количество = Объект.МаксимальноеКоличество - Объект.ТекущееКоличество;
		ТекЗаявка.Записать();
	КонецЕсли;
КонецПроцедуры

